# Joins Problem Statement

In [45]:
import pandas as pd
import pandasql as ps
import numpy as np

df1 = pd.DataFrame([[1234, 'Customer A', '123 Street'],
               [1234, 'Customer A', np.nan],
               ['', 'Customer B', '444 Street'],
              [1233, 'Customer B', '444 Street']], columns=
['ID', 'Customer', 'Billing_Address'])


df2 = pd.DataFrame([[1234,'Customer A', np.nan],
               ['', 'Customer A','333 Street'],
               [1233,'Customer B','333 Street'],
              [1233, 'Customer B','666 Street']], columns=
['ID', 'Customer','Shipping_Address'])

q1 = """SELECT a.ID, a.Customer, a.Billing_Address,b.Shipping_Address FROM df1 a INNER JOIN df2 b on a.ID = b.ID;"""
q2 = """SELECT a.ID, a.Customer, a.Billing_Address,b.Shipping_Address FROM df1 a LEFT JOIN df2 b on a.ID = b.ID;"""
q3 = """SELECT a.ID, a.Customer, a.Billing_Address,b.Shipping_Address FROM df1 a LEFT JOIN df2 b on a.ID = b.ID UNION ALL SELECT a.ID, a.Customer, a.Billing_Address,b.Shipping_Address FROM df2 b LEFT JOIN df1 a on b.ID = a.ID;"""

print("Table1:\n")


# SELECT * FROM t1
# LEFT JOIN t2 ON t1.id = t2.id
# UNION
# SELECT * FROM t1
# RIGHT JOIN t2 ON t1.id = t2.id

print(df1)

print("\n")

print("Table2:\n")

print(df2)
print("\n")
print("Inner Join Result:\n")
print(ps.sqldf(q1, locals()))
print("\n")
print("Left Join Result:\n")
print(ps.sqldf(q2, locals()))
print("\n")
print("Outer Join Result:\n")
print(ps.sqldf(q3, locals()))

Table1:

     ID    Customer Billing_Address
0  1234  Customer A      123 Street
1  1234  Customer A             NaN
2        Customer B      444 Street
3  1233  Customer B      444 Street


Table2:

     ID    Customer Shipping_Address
0  1234  Customer A              NaN
1        Customer A       333 Street
2  1233  Customer B       333 Street
3  1233  Customer B       666 Street


Inner Join Result:

     ID    Customer Billing_Address Shipping_Address
0  1234  Customer A      123 Street             None
1  1234  Customer A            None             None
2        Customer B      444 Street       333 Street
3  1233  Customer B      444 Street       333 Street
4  1233  Customer B      444 Street       666 Street


Left Join Result:

     ID    Customer Billing_Address Shipping_Address
0  1234  Customer A      123 Street             None
1  1234  Customer A            None             None
2        Customer B      444 Street       333 Street
3  1233  Customer B      444 Street       333 Street
4  1233  Customer B      444 Street       666 Street


Outer Join Result:

     ID    Customer Billing_Address Shipping_Address
0  1234  Customer A      123 Street             None
1  1234  Customer A            None             None
2        Customer B      444 Street       333 Street
3  1233  Customer B      444 Street       333 Street
4  1233  Customer B      444 Street       666 Street
5  1234  Customer A            None             None
6  1234  Customer A      123 Street             None
7        Customer B      444 Street       333 Street
8  1233  Customer B      444 Street       333 Street
9  1233  Customer B      444 Street       666 Street

# Cumulative sum using Self Join

In [50]:
cuml_ex = pd.DataFrame([[1, 10],
               [2, 12],
               [3, 3],
               [4, 15],
              [5, 23]], columns=
['ID', 'SomNumt'])
cuml_ex

   ID  SomNumt
0   1       10
1   2       12
2   3        3
3   4       15
4   5       23

In [64]:
# Query to get cumulative sum using self join
cuml_sum_query1 = """Select a.ID, a.SomNumt, SUM (a.SomNumt) OVER (ORDER BY a.ID ) as cumulative_sum 
                    from cuml_ex a Order By a.ID Asc;"""

cuml_sum_query2 = """select a.ID, a.SomNumt, SUM(b.SomNumt) as cumulative_sum
    from cuml_ex a, cuml_ex b where a.ID >= b.ID group by A.id, a.SomNumt order by a.ID;"""


print("Cumulative Sum using Over and Order by:\n")
print(ps.sqldf(cuml_sum_query1, locals()))
print("\n")
print("Cumulative Sum using Self Join:\n")
print(ps.sqldf(cuml_sum_query2, locals()))

Cumulative Sum using Over and Order by:

   ID  SomNumt  cumulative_sum
0   1       10              10
1   2       12              22
2   3        3              25
3   4       15              40
4   5       23              63


Cumulative Sum using Self Join:

   ID  SomNumt  cumulative_sum
0   1       10              10
1   2       12              22
2   3        3              25
3   4       15              40
4   5       23              63

# Cumulative Sum if we have two columns

In [63]:
cuml_ex2 = pd.DataFrame([['A', '22/07/2019',15],
               ['A', '23/07/2019',25],
               ['B', '22/07/2019',45],
               ['B', '23/07/2019',30]], columns=
['company','date', 'amount'])
cuml_ex2

  company        date  amount
0       A  22/07/2019      15
1       A  23/07/2019      25
2       B  22/07/2019      45
3       B  23/07/2019      30

In [65]:
cuml_sum_query3 = """select a.*,SUM(a.amount) OVER (PARTITION BY a.company ORDER BY a.date) as cumulative_sum
    from cuml_ex2 a order by a.date;"""

print(ps.sqldf(cuml_sum_query3, locals()))

  company        date  amount  cumulative_sum
0       A  22/07/2019      15              15
1       B  22/07/2019      45              45
2       A  23/07/2019      25              40
3       B  23/07/2019      30              75

# Cumulative Sum in Python

In [69]:
df_py_cuml = cuml_ex.copy()
df_py_cuml['cumulative_sum'] = cuml_ex['SomNumt'].cumsum()
df_py_cuml

   ID  SomNumt  cumulative_sum
0   1       10              10
1   2       12              22
2   3        3              25
3   4       15              40
4   5       23              63

# Transpose in Python Pandas

In [84]:
import pandas as pd

data = {'A': [11,22,33],
        'B': [44,55,66],
        'C': [77,88,99]
        }

df = pd.DataFrame(data, columns = ['A', 'B', 'C'])

df1 = df.copy()

df1= df.transpose()

print("Before Transpose:\n")
print(df)
print("\n")
print("After Transpose:\n")
print (df1)

Before Transpose:

    A   B   C
0  11  44  77
1  22  55  88
2  33  66  99


After Transpose:

    0   1   2
A  11  22  33
B  44  55  66
C  77  88  99